import { text as text_cfg } from "../../../config";

const share_text = text_cfg.app_name + ' - ' + text_cfg.info.share_tip;

Page({
  /**
   * 页面的初始数据
   */
  data: {
    text_cfg: text_cfg,
    github_link: "https://github.com/2768651338/gksmaopu",
    update_log: [{
      version:"v2.0.1",
      time:"2025/11/18",
      content: [
        "增加公告分享朋友圈",
        "处理照片优化，增加全选/删除/批量处理，同时展示在列表中，避免404而产生的错误",
        "调整wxss",
        "修复已知BUG（感谢LightHouse-1024）",
        "修复已知BUG（感谢xuannfx）",
        "管理员数据看板重磅上线（感谢xuannfx）",
        "修复徽章BUG（LightHouse-1024大佬提供）",
        "修复云函数已知问题",
        "数据看板入口公开给所有用户",
      ]
      },{
      "version": "v2.0.0",
      "time": "2025/6/5",
      "content": [
        "统一主题色背景的文字颜色变量",
        "猫猫详情页面支持查看疫苗记录",
        "优化猫猫详情页面样式和弹窗组件交互",
        "重构管理页面目录结构",
        "修复mask组件的事件穿透问题",
        "优化喵友圈页面性能和缓存策略",
        "统一管理页面权限提示样式",
        "修复版本控制功能",
        "更新个人主页（xuann大佬提供）",
        "更新喵友圈UI（xuann大佬提供）",
        "更新喵友圈UI",
        "更新关注数",
        "代码分包优化",
        "新增喵ID海报生成功能（xuann大佬提供）",
        "新增关注猫猫功能",
        "尝试解决缓存问题",
        "修复用户头像设置问题",
        "修复猫猫部分UI问题",
        "修复重复评分bug",
        "增加猫猫评分",
        "修改关于页统计数和文档链接",
        "合入xuann大佬的PR",
        "关于页UI设计改头换面",
        "修复照片处理小bug",
        "优化首页白屏提示",
        "尝试修复首页白屏问题",
        "徽章榜单也按时间划分",
        "优化徽章榜单的统计效率",
        "前后端代码小重构",
        "修复Loading框问题",
        "修复用户头像缓存问题",
        "尝试修复TabBar设置问题",
        "优化图像处理功能",
        "优化URL签名缓存",
        "点赞榜单修复",
        "部署指引优化",
        "徽章赠送记录",
        "修复首页空白问题",
        "修复科普页加载问题",
        "为新版发布做准备",
        "增加徽章兑换码系统",
        "修复PC端识猫问题",
        "留言板升级为便利贴墙",
        "修复UI问题",
        "更新徽章排行榜",
        "限制每日徽章获取数量",
        "优化徽章系统的加载速度",
        "修复关于页数字不显示的问题",
        "修复徽章系统的小问题",
        "修复徽章系统的小问题",
        "徽章系统上线啦~",
        "精选Tab重置为榜单",
        "修复科普页图片等问题",
        "修复常用工具不显示等问题",
        "修复留言无法被发表者删除问题",
        "加速审核列表加载",
        "修改部分UI问题",
        "支持laf接口签名认证",
        "减少缓存",
        "增加个人信息修改入口",
        "支持Laf 1.0版本",
        "调整图像压缩比例",
        "修复了一些问题",
        "首页外显校区选项改成单选",
        "猫猫照片可以移动了",
        "初始部署优化",
        "后台设置页面重构",
        "UI问题修复",
        "搞一下安全接口",
        "优化数据库存储",
        "缓存数量修复",
        "api访问加固",
        "日期bug修复",
        "修复内容检测接口",
        "图片存储传输优化",
        "后台迁移到laf",
        "识猫、精选页UI优化",
        "修复底Tab样式",
        "修复特邀问题",
        "优化月榜存储",
        "重新实现TabBar",
        "修复重复点赞的bug",
        "修复一堆bug...",
        "优化下部署流程",
        "代码优化请求次数",
        "优化精选tab",
        "增加精选tab，展示点赞照片",
        "首页校区筛选可缓存、分享",
        "修复问题TAT",
        "优化后台人员管理",
        "修复科普图片乱序",
        "修复页面UI小问题",
        "优化管理页面",
        "新增猫猫关系",
        "代码质量",
        "管理员审核照片更顺手啦",
        "公告页样式修改",
        "公告系统登场啦",
        "修复拍照月榜信息获取问题",
        "部署、管理流程优化",
        "猫猫详情页可以点赞了",
        "处理照片和压缩图水印问题",
        "处理.HECI图像显示问题",
        "修复二维码跳转问题",
        "修复cat._no可能冲突问题",
        "修复识猫页显示错误",
        "修复留言板按钮",
        "增加部署指引页",
        "整理内部逻辑",
        "识猫图片中有多只猫时可以选择主体了",
        "修复并整理消息订阅配置",
        "重新设计猫猫详情的大图页面",
        "识猫结果可以筛选了",
        "修复输入框UI问题",
        "首页的新照片提示可以消除啦",
        "照片管理可以只显示精选",
        "修复重复发送留言的问题",
        "增加评论数量外显",
        "新增猫猫留言板",
        "过滤器优化",
        "增加过滤器提示",
        "优化过滤器逻辑",
        "增加领养状态过滤",
        "安卓机可以聊天中识别猫猫啦",
        "过滤器修复",
        "反馈系统改进",
        "其他UI改进和接口升级",
        "人气值与照片数量有关啦",
        "增加看广告打赏方式",
        "识猫功能现在可以框出识别的猫猫了",
        "修复识猫非正方形图片结果不准确的问题",
        "优化猫猫详情页图片预览",
        "其他BUG修复",
        "现在可以拍照识猫啦！",
        "猫猫相册增加排序功能",
        "后台优化",
        "BUG修复",
        "页面优化",
        "优化部分UI",
        "关闭串门页入口",
        "增加几个串门设置项",
        "增加串门功能介绍",
        "UI及已知问题修复",
        "串门功能上线测试！",
        "适配微信小程序登录接口修改！！！",
        "现在可以通过云函数自动处理图片了",
        "后台人员管理增加管理员筛选功能",
        "修复打赏记录月份可能重复添加的问题",
        "现在可以搜索猫猫昵称啦",
        "猫猫信息页照片反序及布局调整",
        "信息反馈增加新猫问卷",
        "统一CSS颜色变量",
        "猫谱、关于页分享至朋友圈功能，欢迎分享宣传！（目前仅Android系统开放测试）",
        "定时反馈处理提醒",
        "修复Android端无法反馈消息的bug",
        "提醒审核功能",
        "后台页面调整",
        "后台人员管理增加搜索功能",
        "猫谱页、猫咪详情页、反馈页、关于页布局调整",
        "修复赞赏记录后台输入限制bug",
        "增加友情链接",
        "问题修复",
        "解决上一版本优化筛选器时因兼容暂缓的问题",
        "后台增加打赏记录编辑（疯狂暗示）",
        "优化筛选器（重建了数据库，头都秃了）",
        "压缩图打水印",
        "增加展示压缩图的选项（流量太贵了...）",
        "关闭上传原图通道",
        "增加版本更新提示",
        "优化猫猫详情页图片预览（感谢华农LoLo同学的建议）",
        "优化后台页面",
        "修复已知问题",
        "适配微信新的小程序通知方式",
        "增加反馈回复通知功能",
        "更新打赏链接",
        "修改关于页加载方式，使返回页面时能重新加载后台待处理数字",
        "修复后台反馈日期显示错误的问题",
        "反馈内容可选中，并增加一键复制",
        "更改管理项样式，更加易于理解",
        "猫猫详情页增加信息反馈",
        "适配一下PC版",
        "管理员权限分级、管理系统",
        "首页样式小调整",
        "清理储存空间",
        "首页加一点点广告（给猫猫救助）",
        "猫猫详情可生成专属小程序码",
        "上传页面的授权按钮修改",
        "一些微小的数据库修改",
        "首页支持模糊搜索啦",
        "上传照片时可选订阅审核完成通知",
        "重构用户表，整理相关逻辑",
        "修改后台设置格式",
        "优化审核流程",
        "增加后台设置项",
        "优化页面逻辑",
        "猫猫分享从首页跳转进入",
        "优化一些交互",
        "优化精选图片数量计算",
        "修复拍照月榜自己的排名",
        "3月打赏公示",
        "小bug修复",
        "增加返回喵星提示（心痛！）",
        "首页增加名字搜索",
        "过滤器大变样，可以多选了",
        "可以一键传多张照片（感谢芥子的建议）",
        "4月打赏公示",
        "排行榜样式更新、并列排名",
        "猫猫详情里的下拉颜色问题",
        "修复相册的一些小问题",
        "未知性别不显示",
        "去掉流量提醒",
        "样式小改动",
        "3月打赏公示",
        "有新照片的猫会排序靠前，并带有明显标志",
        "处理重复刷人气值的问题",
        "加快首页照片加载速度",
        "增加缩略图，缩短首页、相册的加载耗时",
        "预处理水印图，绕开某些安卓闪退问题",
        "首页猫猫在一定范围内打乱顺序展示",
        "优化首页图片加载",
        "优化上传图片功能，可以同时选多张图啦",
        "科普页图片搬家、增加文字换行",
        "修复分享功能",
        "关于页改头换面，增加了四个板块",
        "科普页开始施工了",
        "首页的翻页效果改成了滑溜溜的（我投降）",
        "修复首页快速切换bug"
      ]
    },{
      version:"v1.0.1",
      time:"2025/5/15",
      content: [
        "删除无效的小程序"
      ]
    },
    {
      version: "v1.0.0",
      time: "2025/5/1",
      content: [
        "科师猫谱诞生"
      ]
    },
  ]

},


  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: share_text
    }
  },

  copyOpenSourceLink: function () {
    wx.setClipboardData({
      data: this.data.github_link,
    });
  }
})